# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88

num = [0, 1, 7, 2, 4, 8]
sum_index= 0
if num == []:
    print(0)
else:
    for index in range(0,len(num),2):
        sum_index += num[index]
        print(num[index])
    print(sum_index)
    result = sum_index * num[-1]
    print(result)




