# 1. Необхідно створіти список випадкових чисел із випадковою кількістю елементів від 3 до 10.
# 2. Створить інший список з 3 елементів зі списку з п.1 - першим, третім і другим з кінця.
# Приклад того, як має виглядати фінальний список:
# [1, 2, 3, 4, 5, 6, 7, 9] == [1, 3, 7]
# [1, 1, 2, 1] == [1, 2, 2]
# [6, 3, 7] == [6, 7, 3]
import random
num1 =[]
num2 = []
for i in range(random.randint(3,10)):
    num1.append(random.randint(3,10))
print(num1)
num2.append(num1[0])
num2.append(num1[2])
num2.append(num1[-2])
print(num2)