# 1. Квадрат числа.
#
# Користувач вводить число. Програма виводить його квадрат.
#
# Приклад:
#
# Введіть число: 5
#
# Квадрат числа: 25


number = int(input("Введите число: "))
result = number ** 2
print(f"Ваше число в квадрате: {result}")



# 2. “Середнє трьох чисел”
#
# Програма запитує три числа і виводить їх середнє арифметичне.
#
# Приклад:
#
# Введіть три числа: 2, 4, 6
#
# Середнє: 4.0


num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))
num_3 = int(input("Введите третье число: "))
arithmetic_mean = (num_1 + num_2 + num_3) / 3
print(f"Среднее арифметическое: {arithmetic_mean}")



# 3. “Перетворення хвилин у години”
#
# Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
#
# Приклад:
#
# Введіть кількість хвилин: 135

# 2 години 15 хвилин

minutes = int(input("Введите количество минут: "))
hour = minutes // 60
minutes = minutes % 60
print(f"{hour} часа(ов) {minutes} минут")





# 4. “Розрахунок знижки”

# Користувач вводить ціну товару і розмір знижки у %.
#
# Програма виводить кінцеву ціну.
#
# Приклад:
#
# Введіть ціну: 1000
#
# Введіть знижку (%): 15
#
# Ціна зі знижкою: 850.0

product_amount = int(input("Введите сумму товара: "))
discount = float(input("Введите сумму скидки в % : "))
sum_discount = (product_amount * discount) / 100
discount_price = product_amount - sum_discount
print(f"Cумма вашей скидки: {sum_discount}")
print(f"Цена со скидкой: {discount_price}")



# 5. “Остання цифра числа”
#
# Користувач вводить ціле число, програма виводить його останню цифру.
#
# Приклад:
#
# Введіть число: 347
#
# Остання цифра: 7

numbers = int(input("Введите целое число: "))
last_digit = numbers % 10
print (f"Последняя цифра вашего числа: {last_digit}")





# 6. “Периметр прямокутника”
# Користувач вводить довжину і ширину. Програма виводить периметр.
#
# Приклад:
#
# Введіть довжину: 5
#
# Введіть ширину: 3
#
# Периметр: 16


width = int(input("Введите ширину: "))
length =int(input("Введите длину: "))
perimeter_rectangle = 2 * (width + length)
print(f"Периметр вашего прямоугольника: {perimeter_rectangle}")



# 7. Виведення числа в стовпчик
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик
# цифр,з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4

number = int(input("Введите 4-х значное число : "))
num_1 = number // 1000
num_2 = number // 100 % 10
num_3 = number // 10 % 10
num_4 = number % 10
print("Ваше число состоит из: ")
print (num_1)
print (num_2)
print (num_3)
print (num_4)






