
# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
# Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
# Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
# Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
# у списку парна кількість елементів і в списку непарна кількість елементів.

registry = []
middle_index = len(registry) // 2

if len(registry) % 2 != 0:
    middle_index += 1

part1 = registry[:middle_index]
part2 = registry[middle_index:]

result = [part1, part2]
print(result)