# Ваше завдання — написати програму, яка перемножує всі цифри,
# введені користувачем цілого числа, поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
# 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729, Потім 7 * 2 * 9 = 126,
# потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1


num = int(input("Введите целое число: "))

while num > 9:
    num2 = 1
    result = num
    while result > 0:
        num3 = result % 10
        num2 *=num3
        result = result // 10
    num = num2
print(num)



